ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WLxx/stm32wl55xx.h
/**
  ******************************************************************************
  * @file    stm32wl55xx.h
  * @author  MCD Application Team
  * @brief   CMSIS Cortex Device Peripheral Access Layer Header File.
  *          This file contains all the peripheral register's definitions, bits
  *          definitions and memory mapping for stm32wl55xx devices.
  *
  *          This file contains:selected
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics. 
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Apache License, Version 2.0,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/Apache-2.0
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS_Device
  * @{
  */

/** @addtogroup stm32wl55xx
  * @{
  */

#ifndef __STM32WL55xx_H
#define __STM32WL55xx_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

#define DUAL_CORE


/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
 * @brief stm32wl55xx Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */
#if defined(CORE_CM0PLUS)
  /*!< Interrupt Number Definition for M0 */
  typedef enum
  {
  /******  Cortex-M0 Processor Exceptions Numbers ****************************************************************/
    NonMaskableInt_IRQn          = -14,    /*!< Non Maskable Interrupt                                            */
    HardFault_IRQn               = -13,    /*!< Cortex-M0+ Hard Fault Interrupt                                   */
    SVC_IRQn                     = -5,     /*!< Cortex-M0+ SV Call Interrupt                                      */
    PendSV_IRQn                  = -2,     /*!< Cortex-M0+ Pend SV Interrupt                                      */
    SysTick_IRQn                 = -1,     /*!< Cortex-M0+ System Tick Interrupt                                  */

  /*************  STM32WLxx specific Interrupt Numbers on M0 core ************************************************/
    TZIC_ILA_IRQn                = 0,      /*!< Security Interrupt controller illegal access interrupt            */
    PVD_PVM_IRQn                 = 1,      /*!< PVD and PVM detector                                              */
    RTC_LSECSS_IRQn              = 2,      /*!< RTC Wakeup + RTC Tamper and RTC TimeStamp + RTC Alarms (A & B) and*/
                                           /*!< RTC SSRU Interrupts and LSECSS Interrupts                         */
    RCC_FLASH_C1SEV_IRQn         = 3,      /*!< RCC Interrupt, FLASH interrupt and CPU1 SEV                       */
    EXTI1_0_IRQn                 = 4,      /*!< EXTI Line 1:0 Interrupt                                           */
    EXTI3_2_IRQn                 = 5,      /*!< EXTI Line 3:2 Interrupt                                           */
    EXTI15_4_IRQn                = 6,      /*!< EXTI Line 15:4 interrupt                                          */
    ADC_COMP_DAC_IRQn            = 7,      /*!< ADC, COMP1, COMP2, DAC interrupts                                 */
    DMA1_Channel1_2_3_IRQn       = 8,      /*!< DMA1 Channels 1,2,3 Interrupt                                     */
    DMA1_Channel4_5_6_7_IRQn     = 9,      /*!< DMA1 Channels 4,5,6,7 Interrupt                                   */
    DMA2_DMAMUX1_OVR_IRQn        = 10,     /*!< DMA2 Channels[1..7] and DMAMUX1 Overrun Interrupt                 */
    LPTIM1_IRQn                  = 11,     /*!< LPTIM1 Global Interrupt                                           */
    LPTIM2_IRQn                  = 12,     /*!< LPTIM2 Global Interrupt                                           */
    LPTIM3_IRQn                  = 13,     /*!< LPTIM3 Global Interrupt                                           */
    TIM1_IRQn                    = 14,     /*!< TIM1 Global Interrupt                                             */
    TIM2_IRQn                    = 15,     /*!< TIM2 Global Interrupt                                             */
    TIM16_IRQn                   = 16,     /*!< TIM16 Global Interrupt                                            */
    TIM17_IRQn                   = 17,     /*!< TIM17 Global Interrupt                                            */
    IPCC_C2_RX_C2_TX_IRQn        = 18,     /*!< IPCC RX Occupied and TX Free Interrupt                            */
    HSEM_IRQn                    = 19,     /*!< HSEM Interrupt                                                    */
    RNG_IRQn                     = 20,     /*!< RNG Interrupt                                                     */
    AES_PKA_IRQn                 = 21,     /*!< AES and PKA Interrupt                                             */
    I2C1_IRQn                    = 22,     /*!< I2C1 Event and Error Interrupt                                    */
    I2C2_IRQn                    = 23,     /*!< I2C2 Event and Error Interrupt                                    */
    I2C3_IRQn                    = 24,     /*!< I2C3 Event and Error Interrupt                                    */
    SPI1_IRQn                    = 25,     /*!< SPI1 Interrupt                                                    */
    SPI2_IRQn                    = 26,     /*!< SPI2 Interrupt                                                    */
    USART1_IRQn                  = 27,     /*!< USART1 Interrupt                                                  */
    USART2_IRQn                  = 28,     /*!< USART2 Interrupt                                                  */
    LPUART1_IRQn                 = 29,     /*!< LPUART1 Interrupt                                                 */
    SUBGHZSPI_IRQn               = 30,     /*!< SUBGHZSPI Interrupt                                               */
    SUBGHZ_Radio_IRQn            = 31,     /*!< SUBGHZ Radio Interrupt                                            */
  } IRQn_Type;
#else /* CORE_CM4 */
/*!< Interrupt Number Definition for M4 */
typedef enum
{
/******  Cortex-M4 Processor Exceptions Numbers ****************************************************************/
  NonMaskableInt_IRQn                 = -14,    /*!< Non Maskable Interrupt                                            */
  HardFault_IRQn                      = -13,    /*!< Cortex-M4 Hard Fault Interrupt                                    */
  MemoryManagement_IRQn               = -12,    /*!< Cortex-M4 Memory Management Interrupt                             */
  BusFault_IRQn                       = -11,    /*!< Cortex-M4 Bus Fault Interrupt                                     */
  UsageFault_IRQn                     = -10,    /*!< Cortex-M4 Usage Fault Interrupt                                   */
  SVCall_IRQn                         = -5,     /*!< Cortex-M4 SV Call Interrupt                                       */
  DebugMonitor_IRQn                   = -4,     /*!< Cortex-M4 Debug Monitor Interrupt                                 */
  PendSV_IRQn                         = -2,     /*!< Cortex-M4 Pend SV Interrupt                                       */
  SysTick_IRQn                        = -1,     /*!< Cortex-M4 System Tick Interrupt                                   */

/*************  STM32WLxx specific Interrupt Numbers on M4 core ************************************************/
  WWDG_IRQn                           = 0,      /*!< Window WatchDog Interrupt                                         */
  PVD_PVM_IRQn                        = 1,      /*!< PVD and PVM detector                                              */
  TAMP_STAMP_LSECSS_SSRU_IRQn         = 2,      /*!< RTC Tamper, RTC TimeStamp, LSECSS and RTC SSRU Interrupts         */
  RTC_WKUP_IRQn                       = 3,      /*!< RTC Wakeup Interrupt                                              */
  FLASH_IRQn                          = 4,      /*!< FLASH (CFI)  global Interrupt                                     */
  RCC_IRQn                            = 5,      /*!< RCC Interrupt                                                     */
  EXTI0_IRQn                          = 6,      /*!< EXTI Line 0 Interrupt                                             */
  EXTI1_IRQn                          = 7,      /*!< EXTI Line 1 Interrupt                                             */
  EXTI2_IRQn                          = 8,      /*!< EXTI Line 2 Interrupt                                             */
  EXTI3_IRQn                          = 9,      /*!< EXTI Line 3 Interrupt                                             */
  EXTI4_IRQn                          = 10,     /*!< EXTI Line 4 Interrupt                                             */
  DMA1_Channel1_IRQn                  = 11,     /*!< DMA1 Channel 1 Interrupt                                          */
  DMA1_Channel2_IRQn                  = 12,     /*!< DMA1 Channel 2 Interrupt                                          */
  DMA1_Channel3_IRQn                  = 13,     /*!< DMA1 Channel 3 Interrupt                                          */
  DMA1_Channel4_IRQn                  = 14,     /*!< DMA1 Channel 4 Interrupt                                          */
  DMA1_Channel5_IRQn                  = 15,     /*!< DMA1 Channel 5 Interrupt                                          */
  DMA1_Channel6_IRQn                  = 16,     /*!< DMA1 Channel 6 Interrupt                                          */
  DMA1_Channel7_IRQn                  = 17,     /*!< DMA1 Channel 7 Interrupt                                          */
  ADC_IRQn                            = 18,     /*!< ADC Interrupt                                                     */
  DAC_IRQn                            = 19,     /*!< DAC Interrupt                                                     */
  C2SEV_PWR_C2H_IRQn                  = 20,     /*!< CPU2 SEV Interrupt                                                */
  COMP_IRQn                           = 21,     /*!< COMP1 and COMP2 Interrupts                                        */
  EXTI9_5_IRQn                        = 22,     /*!< EXTI Lines [9:5] Interrupt                                        */
  TIM1_BRK_IRQn                       = 23,     /*!< TIM1 Break Interrupt                                              */
  TIM1_UP_IRQn                        = 24,     /*!< TIM1 Update Interrupt                                             */
  TIM1_TRG_COM_IRQn                   = 25,     /*!< TIM1 Trigger and Communication Interrupts                         */
  TIM1_CC_IRQn                        = 26,     /*!< TIM1 Capture Compare Interrupt                                    */
  TIM2_IRQn                           = 27,     /*!< TIM2 Global Interrupt                                             */
  TIM16_IRQn                          = 28,     /*!< TIM16 Global Interrupt                                            */
  TIM17_IRQn                          = 29,     /*!< TIM17 Global Interrupt                                            */
  I2C1_EV_IRQn                        = 30,     /*!< I2C1 Event Interrupt                                              */
  I2C1_ER_IRQn                        = 31,     /*!< I2C1 Error Interrupt                                              */
  I2C2_EV_IRQn                        = 32,     /*!< I2C2 Event Interrupt                                              */
  I2C2_ER_IRQn                        = 33,     /*!< I2C2 Error Interrupt                                              */
  SPI1_IRQn                           = 34,     /*!< SPI1 Interrupt                                                    */
  SPI2_IRQn                           = 35,     /*!< SPI2 Interrupt                                                    */
  USART1_IRQn                         = 36,     /*!< USART1 Interrupt                                                  */
  USART2_IRQn                         = 37,     /*!< USART2 Interrupt                                                  */
  LPUART1_IRQn                        = 38,     /*!< LPUART1 Interrupt                                                 */
  LPTIM1_IRQn                         = 39,     /*!< LPTIM1 Global Interrupt                                           */
  LPTIM2_IRQn                         = 40,     /*!< LPTIM2 Global Interrupt                                           */
  EXTI15_10_IRQn                      = 41,     /*!< EXTI Lines [15:10] Interrupt                                      */
  RTC_Alarm_IRQn                      = 42,     /*!< RTC Alarms (A and B) Interrupt                                    */
  LPTIM3_IRQn                         = 43,     /*!< LPTIM3 Global Interrupt                                           */
  SUBGHZSPI_IRQn                      = 44,     /*!< SUBGHZSPI Interrupt                                               */
  IPCC_C1_RX_IRQn                     = 45,     /*!< IPCC RX Occupied Interrupt                                        */
  IPCC_C1_TX_IRQn                     = 46,     /*!< IPCC TX Free Interrupt                                            */
  HSEM_IRQn                           = 47,     /*!< HSEM Interrupt                                                    */
  I2C3_EV_IRQn                        = 48,     /*!< I2C3 Event Interrupt                                              */
  I2C3_ER_IRQn                        = 49,     /*!< I2C3 Error Interrupt                                              */
  SUBGHZ_Radio_IRQn                   = 50,     /*!< SUBGHZ Radio Interrupt                                            */
  AES_IRQn                            = 51,     /*!< AES Interrupt                                                     */
  RNG_IRQn                            = 52,     /*!< RNG Interrupt                                                     */
  PKA_IRQn                            = 53,     /*!< PKA Interrupt                                                     */
  DMA2_Channel1_IRQn                  = 54,     /*!< DMA2 Channel 1 Interrupt                                          */
  DMA2_Channel2_IRQn                  = 55,     /*!< DMA2 Channel 2 Interrupt                                          */
  DMA2_Channel3_IRQn                  = 56,     /*!< DMA2 Channel 3 Interrupt                                          */
  DMA2_Channel4_IRQn                  = 57,     /*!< DMA2 Channel 4 Interrupt                                          */
  DMA2_Channel5_IRQn                  = 58,     /*!< DMA2 Channel 5 Interrupt                                          */
  DMA2_Channel6_IRQn                  = 59,     /*!< DMA2 Channel 6 Interrupt                                          */
  DMA2_Channel7_IRQn                  = 60,     /*!< DMA2 Channel 7 Interrupt                                          */
  DMAMUX1_OVR_IRQn                    = 61      /*!< DMAMUX1 overrun Interrupt                                         */
} IRQn_Type;
/**
  * @}
  */
#endif

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */
#if defined(CORE_CM0PLUS)
/**
  * @brief Configuration of the Cortex-M0+ Processor and Core Peripherals
  */
#define __CM0PLUS_REV             1U /*!< Core Revision r0p1                            */
#define __MPU_PRESENT             1U /*!< M0 provides an MPU                            */
#define __VTOR_PRESENT            1U /*!< Vector Table Register supported               */
#define __NVIC_PRIO_BITS          2U /*!< M0 core uses 2 Bits for the Priority Levels   */
#define __Vendor_SysTickConfig    0U /*!< Set to 1 if different SysTick Config is used  */
#define __FPU_PRESENT             0U /*!< FPU not present                               */

