ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WLxx/stm32wl55xx.h
#define FLASH_SIZE              (((*((uint32_t *)FLASHSIZE_BASE)) & 0xFFFFU) << 10U)
#define SRAM1_SIZE              0x00008000UL   /*!< SRAM1 default size : 32 kB */
#define SRAM2_SIZE              0x00008000UL   /*!< SRAM2 default size : 32 kB  */

/*!< Memory, OTP and Option bytes */
#define RSSLIB_PFUNC_BASE       (SYSTEM_FLASH_BASE + 0x00003A00UL) /*!< RSS area                                      */
#define OTP_AREA_BASE           (SYSTEM_FLASH_BASE + 0x00007000UL) /*!< OTP area : 1kB (0x1FFF7000 – 0x1FFF73FF)      */
#define ENGI_BYTES_BASE         (SYSTEM_FLASH_BASE + 0x00007400UL) /*!< Engi Bytes : 1kB (0x1FFF7400 – 0x1FFF77FF)    */
#define OPTION_BYTES_BASE       (SYSTEM_FLASH_BASE + 0x00007800UL) /*!< Option Bytes : 2kB (0x1FFF7800 – 0x1FFF7FFF)  */

/*!< Device Electronic Signature */
#define PACKAGE_BASE            (ENGI_BYTES_BASE + 0x00000100UL) /*!< Package data register base address     */
#define UID64_BASE              (ENGI_BYTES_BASE + 0x00000180UL) /*!< 64-bit Unique device Identification    */
#define UID_BASE                (ENGI_BYTES_BASE + 0x00000190UL) /*!< Unique device ID register base address */
#define FLASHSIZE_BASE          (ENGI_BYTES_BASE + 0x000001E0UL) /*!< Flash size data register base address  */

#define SYSTEM_MEMORY_END_ADDR  (0x1FFF6FFFUL)   /*!< System Memory : 28KB (0x1FFF0000 – 0x1FFF6FFF)  */
#define OTP_AREA_END_ADDR       (0x1FFF73FFUL)   /*!< OTP area : 1KB (0x1FFF7000 – 0x1FFF73FF)        */
#define ENGI_BYTE_END_ADDR      (0x1FFF77FFUL)   /*!< Engi Bytes : 1kB (0x1FFF7400 – 0x1FFF77FF)      */
#define OPTION_BYTE_END_ADDR    (0x1FFF7FFFUL)   /*!< Option Bytes : 2KB (0x1FFF7800 – 0x1FFF7FFF)    */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE         PERIPH_BASE
#define APB2PERIPH_BASE         (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE         (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE         (PERIPH_BASE + 0x08000000UL)
#define AHB3PERIPH_BASE         (PERIPH_BASE + 0x18000000UL)
#define APB3PERIPH_BASE         (PERIPH_BASE + 0x18010000UL)

/*!< APB1 peripherals */
#define TIM2_BASE               (APB1PERIPH_BASE + 0x00000000UL)
#define RTC_BASE                (APB1PERIPH_BASE + 0x00002800UL)
#define WWDG_BASE               (APB1PERIPH_BASE + 0x00002C00UL)
#define IWDG_BASE               (APB1PERIPH_BASE + 0x00003000UL)
#define SPI2_BASE               (APB1PERIPH_BASE + 0x00003800UL)
#define USART2_BASE             (APB1PERIPH_BASE + 0x00004400UL)
#define I2C1_BASE               (APB1PERIPH_BASE + 0x00005400UL)
#define I2C2_BASE               (APB1PERIPH_BASE + 0x00005800UL)
#define I2C3_BASE               (APB1PERIPH_BASE + 0x00005C00UL)
#define DAC_BASE                (APB1PERIPH_BASE + 0x00007400UL)
#define LPTIM1_BASE             (APB1PERIPH_BASE + 0x00007C00UL)
#define LPUART1_BASE            (APB1PERIPH_BASE + 0x00008000UL)
#define LPTIM2_BASE             (APB1PERIPH_BASE + 0x00009400UL)
#define LPTIM3_BASE             (APB1PERIPH_BASE + 0x00009800UL)
#define TAMP_BASE               (APB1PERIPH_BASE + 0x0000B000UL)

/*!< APB2 peripherals */
#define SYSCFG_BASE             (APB2PERIPH_BASE + 0x00000000UL)
#define VREFBUF_BASE            (APB2PERIPH_BASE + 0x00000030UL)
#define COMP1_BASE              (APB2PERIPH_BASE + 0x00000200UL)
#define COMP2_BASE              (APB2PERIPH_BASE + 0x00000204UL)
#define ADC_BASE                (APB2PERIPH_BASE + 0x00002400UL)
#define ADC_COMMON_BASE         (APB2PERIPH_BASE + 0x00002708UL)
#define TIM1_BASE               (APB2PERIPH_BASE + 0x00002C00UL)
#define SPI1_BASE               (APB2PERIPH_BASE + 0x00003000UL)
#define USART1_BASE             (APB2PERIPH_BASE + 0x00003800UL)
#define TIM16_BASE              (APB2PERIPH_BASE + 0x00004400UL)
#define TIM17_BASE              (APB2PERIPH_BASE + 0x00004800UL)

/*!< AHB1 peripherals */
#define DMA1_BASE               (AHB1PERIPH_BASE + 0x00000000UL)
#define DMA2_BASE               (AHB1PERIPH_BASE + 0x00000400UL)
#define DMAMUX1_BASE            (AHB1PERIPH_BASE + 0x00000800UL)
#define CRC_BASE                (AHB1PERIPH_BASE + 0x00003000UL)

#define DMA1_Channel1_BASE       (DMA1_BASE + 0x00000008UL)
#define DMA1_Channel2_BASE       (DMA1_BASE + 0x0000001CUL)
#define DMA1_Channel3_BASE       (DMA1_BASE + 0x00000030UL)
#define DMA1_Channel4_BASE       (DMA1_BASE + 0x00000044UL)
#define DMA1_Channel5_BASE       (DMA1_BASE + 0x00000058UL)
#define DMA1_Channel6_BASE       (DMA1_BASE + 0x0000006CUL)
#define DMA1_Channel7_BASE       (DMA1_BASE + 0x00000080UL)

#define DMA2_Channel1_BASE       (DMA2_BASE + 0x00000008UL)
#define DMA2_Channel2_BASE       (DMA2_BASE + 0x0000001CUL)
#define DMA2_Channel3_BASE       (DMA2_BASE + 0x00000030UL)
#define DMA2_Channel4_BASE       (DMA2_BASE + 0x00000044UL)
#define DMA2_Channel5_BASE       (DMA2_BASE + 0x00000058UL)
#define DMA2_Channel6_BASE       (DMA2_BASE + 0x0000006CUL)
#define DMA2_Channel7_BASE       (DMA2_BASE + 0x00000080UL)

#define DMAMUX1_Channel0_BASE    (DMAMUX1_BASE)
#define DMAMUX1_Channel1_BASE    (DMAMUX1_BASE + 0x00000004UL)
#define DMAMUX1_Channel2_BASE    (DMAMUX1_BASE + 0x00000008UL)
#define DMAMUX1_Channel3_BASE    (DMAMUX1_BASE + 0x0000000CUL)
#define DMAMUX1_Channel4_BASE    (DMAMUX1_BASE + 0x00000010UL)
#define DMAMUX1_Channel5_BASE    (DMAMUX1_BASE + 0x00000014UL)
#define DMAMUX1_Channel6_BASE    (DMAMUX1_BASE + 0x00000018UL)
#define DMAMUX1_Channel7_BASE    (DMAMUX1_BASE + 0x0000001CUL)
#define DMAMUX1_Channel8_BASE    (DMAMUX1_BASE + 0x00000020UL)
#define DMAMUX1_Channel9_BASE    (DMAMUX1_BASE + 0x00000024UL)
#define DMAMUX1_Channel10_BASE   (DMAMUX1_BASE + 0x00000028UL)
#define DMAMUX1_Channel11_BASE   (DMAMUX1_BASE + 0x0000002CUL)
#define DMAMUX1_Channel12_BASE   (DMAMUX1_BASE + 0x00000030UL)
#define DMAMUX1_Channel13_BASE   (DMAMUX1_BASE + 0x00000034UL)

#define DMAMUX1_RequestGenerator0_BASE  (DMAMUX1_BASE + 0x00000100UL)
#define DMAMUX1_RequestGenerator1_BASE  (DMAMUX1_BASE + 0x00000104UL)
#define DMAMUX1_RequestGenerator2_BASE  (DMAMUX1_BASE + 0x00000108UL)
#define DMAMUX1_RequestGenerator3_BASE  (DMAMUX1_BASE + 0x0000010CUL)

#define DMAMUX1_ChannelStatus_BASE      (DMAMUX1_BASE + 0x00000080UL)
#define DMAMUX1_RequestGenStatus_BASE   (DMAMUX1_BASE + 0x00000140UL)

/*!< AHB2 peripherals */
#define IOPORT_BASE             (AHB2PERIPH_BASE + 0x00000000UL)
#define GPIOA_BASE              (IOPORT_BASE + 0x00000000UL)
#define GPIOB_BASE              (IOPORT_BASE + 0x00000400UL)
#define GPIOC_BASE              (IOPORT_BASE + 0x00000800UL)
#define GPIOH_BASE              (IOPORT_BASE + 0x00001C00UL)

/*!< AHB3 peripherals */
#define PWR_BASE                (AHB3PERIPH_BASE + 0x00000400UL)
#define EXTI_BASE               (AHB3PERIPH_BASE + 0x00000800UL)
#define IPCC_BASE               (AHB3PERIPH_BASE + 0x00000C00UL)
#define RCC_BASE                (AHB3PERIPH_BASE + 0x00000000UL)
#define RNG_BASE                (AHB3PERIPH_BASE + 0x00001000UL)
#define HSEM_BASE               (AHB3PERIPH_BASE + 0x00001400UL)
#define AES_BASE                (AHB3PERIPH_BASE + 0x00001800UL)
#define PKA_BASE                (AHB3PERIPH_BASE + 0x00002000UL)
#define FLASH_REG_BASE          (AHB3PERIPH_BASE + 0x00004000UL)
#define GTZC_TZSC_BASE          (AHB3PERIPH_BASE + 0x00004400UL)
#define GTZC_TZIC_BASE          (AHB3PERIPH_BASE + 0x00004800UL)

/*!< APB3 peripherals */
#define SUBGHZSPI_BASE          (APB3PERIPH_BASE + 0x00000000UL)

